      * Paragraphs - 
       identification division.
       program-id. cobtut4.
       author. ladoblanco.
       date-written. September 4th 2024.
       environment division.
       configuration section.
       data division.
       file section.
       working-storage section.
       
       procedure division.
           display 'I''m getting better!'

       stop run.
